; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	satellite4 - satellite
	instrument8 - instrument
	infrared1 - mode
	spectrograph0 - mode
	image3 - mode
	infrared2 - mode
	GroundStation1 - direction
	GroundStation4 - direction
	Star5 - direction
	GroundStation3 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Star10 - direction
	Star11 - direction
	Star12 - direction
	Star13 - direction
	Planet14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star5)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet14)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 infrared2)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 infrared2)
	(supports instrument3 image3)
	(supports instrument3 spectrograph0)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 infrared2)
	(supports instrument4 infrared1)
	(supports instrument4 spectrograph0)
	(calibration_target instrument4 GroundStation7)
	(calibration_target instrument4 GroundStation6)
	(supports instrument5 infrared1)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star5)
	(supports instrument6 infrared2)
	(supports instrument6 infrared1)
	(calibration_target instrument6 GroundStation3)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star12)
	(supports instrument7 infrared2)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 Star0)
	(on_board instrument7 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon8)
	(supports instrument8 image3)
	(calibration_target instrument8 GroundStation6)
	(calibration_target instrument8 GroundStation7)
	(on_board instrument8 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Planet9)
)
(:goal (and
	(pointing satellite0 Star0)
	(have_image Phenomenon8 spectrograph0)
	(have_image Planet9 image3)
	(have_image Star10 spectrograph0)
	(have_image Star11 spectrograph0)
	(have_image Star12 infrared1)
	(have_image Star13 infrared1)
	(have_image Planet14 infrared1)
	(have_image Star15 image3)
))

)

; plan
1. (turn_to satellite0 star5 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 star5)
   goals met: 0 of 9
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 9
3. (calibrate satellite0 instrument0 star5)
   added: (calibrated instrument0)
   goals met: 0 of 9
4. (turn_to satellite0 star11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star11)
   goals met: 0 of 9
5. (take_image satellite0 star11 instrument0 spectrograph0)
   added: (have_image star11 spectrograph0)
   goals met: 1 of 9
6. (turn_to satellite0 star10 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star10)
   goals met: 1 of 9
7. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 2 of 9
8. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 2 of 9
9. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 3 of 9
10. (turn_to satellite0 planet14 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet14)
   goals met: 3 of 9
11. (take_image satellite0 planet14 instrument0 infrared1)
   added: (have_image planet14 infrared1)
   goals met: 4 of 9
12. (turn_to satellite0 phenomenon8 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 phenomenon8)
   goals met: 4 of 9
13. (take_image satellite0 phenomenon8 instrument0 spectrograph0)
   added: (have_image phenomenon8 spectrograph0)
   goals met: 5 of 9
14. (turn_to satellite0 star12 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 star12)
   goals met: 5 of 9
15. (take_image satellite0 star12 instrument0 infrared1)
   added: (have_image star12 infrared1)
   goals met: 6 of 9
16. (turn_to satellite0 star13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star13)
   goals met: 6 of 9
17. (take_image satellite0 star13 instrument0 infrared1)
   added: (have_image star13 infrared1)
   goals met: 7 of 9
18. (turn_to satellite0 star15 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star15)
   goals met: 7 of 9
19. (take_image satellite0 star15 instrument0 image3)
   added: (have_image star15 image3)
   goals met: 8 of 9
20. (turn_to satellite0 star0 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 star0)
   goals met: 9 of 9
